######################################################
# my_list = [[0], [1, 2], [3, 4, 5]]

# print(my_list)
# print(my_list[0])
# print(my_list[1])
# print(my_list[2])
# print(len(my_list))
######################################################
# my_list = ['Python', [10, 20, 30], ['Beegeek', 'Stepik']]

# print(my_list[0])
# print(my_list[1])
# print(my_list[2])
######################################################

# my_list = ['Python', [10, 20, 30], ['Beegeek', 'Stepik!']]

# print(my_list[0][2])       # индексирование строки 'Python'
# print(my_list[1][1])       # индексирование списка [10, 20, 30]
# print(my_list[2][-1])      # индексирование списка ['Beegeek', 'Stepik!']
# print(my_list[2][-1][-1])  # индексирование строки 'Stepik!'
######################################################
# total = 0
# my_list = [[0], [1, 2], [3, 4, 5], [], [10, 20, 30]]

# for li in my_list:
#     total += len(li)

# print(total)
######################################################
# list1 = [[1, 7, 12, 0, 9, 100], [1, 7, 90], [1, 10]]
# list2 = [['a', 'b'], ['a'], ['d', 'p', 'q']]

# print(min(list1))
# print(max(list1))
# print(min(list2))
# print(max(list2))
######################################################
# метод append() добавляет новый элемент в конец списка.
# метод extend() расширяет один список другим списком.
# метод insert() вставляет значение в список в заданной позиции.
# метод index() возвращает индекс первого элемента, значение которого равняется переданному в метод значению.
# метод remove() удаляет первый элемент, значение которого равняется переданному в метод значению.
# метод pop() удаляет элемент по указанному индексу и возвращает его.
# метод count() возвращает количество элементов в списке, значения которых равны переданному в метод значению.
# метод reverse() инвертирует порядок следования значений в списке, то есть меняет его на противоположный.
# метод copy() создает поверхностную копию списка.
# метод clear() удаляет все элементы из списка.
# оператор del позволяет удалять элементы списка по определенному индексу.
# метод split() разбивает строку на слова, используя в качестве разделителя последовательность пробельных символов, символ табуляции(\t) или символ новой строки(\n).
# метод join() собирает строку из элементов списка, используя в качестве разделителя строку, к которой применяется метод.
######################################################
# list1 = [[1, 8, 9], [4, 8, 12, 16], [0, 2, 7]]
# print(list1[0][1] + list1[1][2] + list1[2][2])
######################################################
# list1 = [[1, 8, 9], [4, 8, 12, 16], [0, 2, 7]]
# print(list1[0][1] + list1[3][2] + list1[2][2])
######################################################
# list1 = ['Beegeek', [4, 8, 12, 16]]
# print(list1[0][1])
# print(list1[1][3])
######################################################

# list1 = [[0, [9, 2]], [1, [4, 6, 3], [5, 2, 3], 8, 3]]
# print(list1[1][2][1])
######################################################

# list1 = [[1, 2, 3], [4, 5], [8], [1, 2, 3, 4]]
# print(len(list1))
######################################################
# list1 = [[[1, 1, 0], [0, 1, 1]], [[0, 1], [1, 1], [1, 0]]]
# print(len(list1))
######################################################

# list1 = [[1, 8, 7, 4], [1, 3, 4, 5], [2, 7, 2], [2, 6, 7, 8]]
# list1.reverse()
# print(list1)
######################################################

# list1 = [[1, 8, 7, 4], [1, 3, 4, 5, 6], [2, 7, 2], [2, 6, 7, 8]]
# print(max(list1))
######################################################
# list1 = [[1, 8, 7, 4], [1, 3, 4, 5, 6], [2, 7, 2], [2, 6, 7, 8]]
# del list1[1]
# print(list1)
######################################################
# list1 = [[1, 8, 7, 4], [1, 3, 4, 5, 6], [2, 7, 2], [2, 6, 7, 8]]
# del list1[1][1]
# print(list1)
######################################################

# 12 #########################
# list1 = [10, 20, [300, 400, [5000, 6000], 500], 30, 40]
# list1[2][2].append(7000)
# print(list1)


######################################################

# 13 #########################
# Дополните приведенный код, используя списочный метод extend(), чтобы список list1 имел вид:
#list1 = ['a', 'b', ['c', ['d', 'e', ['f', 'g', 'h', 'i', 'j'], 'k'], 'l'], 'm', 'n']

# list1 = ['a', 'b', ['c', ['d', 'e', ['f', 'g'], 'k'], 'l'], 'm', 'n']
# sub_list = ['h', 'i', 'j']
# list1[2][1][2].extend(sub_list)

# print(list1)

######################################################

# 14 #########################
# Дополните приведенный код, используя цикл for и встроенную функцию max(), чтобы он выводил один общий максимальный элемент среди всех элементов вложенных списков list1.
# list1 = [[1, 7, 8], [9, 7, 102], [6, 106, 105], [100, 99, 98, 103], [1, 2, 3]]
# maximum = -1

# for item in list1:
#     if max(item) > maximum:
#         maximum = max(item)

# print(maximum)

######################################################

# 15 #########################
# Дополните приведенный код так, чтобы список list1 имел вид: list1 = [[8, 7, 1], [102, 7, 9], [105, 106, 102], [103, 98, 99, 100], [3, 2, 1]]
# list1 = [[1, 7, 8], [9, 7, 102], [102, 106, 105],
#          [100, 99, 98, 103], [1, 2, 3]]
# for item in list1:
#     item = item.reverse()

# print(list1)
######################################################

# 16 #########################
# Дополните приведенный код так, чтобы он выводил единственное число: сумму всех чисел списка list1 разделённую на общее количество всех чисел.
list1 = [[1, 7, 8], [9, 7, 102], [102, 106, 105],
         [100, 99, 98, 103], [1, 2, 3]]
total = 0
counter = 0

for item in list1:
    total += sum(item)
    counter += len(item)
print(total/counter)

######################################################
